### Transformation function

In [34]:
import pandas as pd
import numpy as np
df = pd.read_csv("/Users/mohammadasim/Desktop/Python/14. Pandas/5. Data-Grouping and Aggregation/orders.csv")

In [35]:
df

         order_id product_name         category       city  sales  profit
0  CA-2020-152156           p1        Furniture  Bangalore  10000     500
1  CA-2020-138688           p2        Furniture  Bangalore  20000     400
2  US-2019-108966           p3       Technology    Chennai  25000     200
3  CA-2021-114412           p4  Office Supplies    Chennai  30000     250
4  CA-2020-161389           p5       Technology  Bangalore  35000     800
5  US-2019-119883           p6  Office Supplies  Bangalore  40000     700

In [36]:
grouped = df.groupby('category')

In [37]:
for x,y in grouped:
    print(x)
    print(y)

Furniture
         order_id product_name   category       city  sales  profit
0  CA-2020-152156           p1  Furniture  Bangalore  10000     500
1  CA-2020-138688           p2  Furniture  Bangalore  20000     400
Office Supplies
         order_id product_name         category       city  sales  profit
3  CA-2021-114412           p4  Office Supplies    Chennai  30000     250
5  US-2019-119883           p6  Office Supplies  Bangalore  40000     700
Technology
         order_id product_name    category       city  sales  profit
2  US-2019-108966           p3  Technology    Chennai  25000     200
4  CA-2020-161389           p5  Technology  Bangalore  35000     800

In [38]:
df.groupby('category').sales.transform('mean')

0    15000.0
1    15000.0
2    30000.0
3    35000.0
4    30000.0
5    35000.0
Name: sales, dtype: float64

### Example 2

In [39]:
import pandas as pd

In [40]:
df = pd.DataFrame({
    'team': ['A', 'A', 'A', 'A', 'B', 'B', 'B', 'B'],
    'points': [30, 22, 19, 14, 14, 11, 20, 28]
  })
df

  team  points
0    A      30
1    A      22
2    A      19
3    A      14
4    B      14
5    B      11
6    B      20
7    B      28

In [41]:
df.groupby('team')

In [42]:
for x,y in df.groupby('team'):
    print(x)
    print(y)

A
  team  points
0    A      30
1    A      22
2    A      19
3    A      14
B
  team  points
4    B      14
5    B      11
6    B      20
7    B      28

In [43]:
df.groupby('team')['points'].transform('mean')

0    21.25
1    21.25
2    21.25
3    21.25
4    18.25
5    18.25
6    18.25
7    18.25
Name: points, dtype: float64